Revit 2024 API
Transform1D.Dispose Method
Releases all resources used by the Transform1D
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Dispose()
Visual Basic
Public Sub Dispose
Visual C++
public:
virtual void Dispose() sealed
Implements
IDisposable.Dispose()
See Also
Transform1D Class
Autodesk.Revit.DB Namespace